## Movie Ratings

In [1]:
# Dependencies
import pandas as pd
from sqlalchemy import create_engine

In [2]:
imdb = './IMDb_movies.csv'
imdb_df = pd.read_csv(imdb)
imdb_df.head()

C:\Users\alig_\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,None,Alexander Black,...,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,None,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,446,$ 45000,NaN,NaN,NaN,25.0,3.0
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2237,NaN,NaN,NaN,NaN,31.0,14.0

In [3]:
# Only show USA movies
imdb_df = imdb_df[imdb_df["country"] == "USA"]
imdb_df

# Drop columns    
imdb_df = imdb_df.drop(columns=['imdb_title_id','original_title','year', 'date_published', 'duration',
                                'language', 'director', 'writer', 'actors', 'description', 'votes', 'budget', 
                                'usa_gross_income', 'worlwide_gross_income', 'metascore', 'reviews_from_users', 
                                'reviews_from_critics'])
imdb_df

,title,genre,country,production_company,avg_vote
0,Miss Jerry,Romance,USA,Alexander Black Photoplays,5.9
3,Cleopatra,"Drama, History",USA,Helen Gardner Picture Players,5.2
5,"From the Manger to the Cross; or, Jesus of Naz...","Biography, Drama",USA,Kalem Company,5.7
17,Amore di madre,Drama,USA,Majestic Motion Picture Company,5.8
19,Traffic in Souls,"Crime, Drama",USA,Independent Moving Pictures Co. of America (IMP),6.0
...,...,...,...,...,...
85829,Season of Love,"Comedy, Romance",USA,Tello Films,7.5
85830,Bulletproof 2,"Action, Comedy",USA,Universal 1440 Entertainment,3.5
85837,VFW,"Action, Crime, Horror",USA,Fangoria,6.1
85838,The Pilgrim's Progress,"Animation, Adventure, Family",USA,Cat In The Mill Studio,5.7
85839,Coffee & Kareem,"Action, Comedy",USA,Pacific Electric Picture Company,5.1

In [4]:
imdb_df.dtypes

title                  object
genre                  object
country                object
production_company     object
avg_vote              float64
dtype: object

In [5]:
# Create rotten tomatoes ratings
rt = './rotten_tomatoes_top_movies_2019-01-15.csv'
rt_df = pd.read_csv(rt)
rt_df.head()

,Rank,Title,RatingTomatometer,No_of_Reviews,Genres
0,1,Black Panther,97,444,action|adventure
1,2,Mad Max: Fury Road,97,394,action|adventure
2,3,Wonder Woman,93,410,action|adventure
3,4,Metropolis,99,118,action|adventure
4,5,Coco,97,308,action|adventure

In [6]:
# Drop columns    
rt_df = rt_df.drop(columns=['Rank','No_of_Reviews','Genres'])
rt_df

                   Title  RatingTomatometer
0          Black Panther                 97
1     Mad Max: Fury Road                 97
2           Wonder Woman                 93
3             Metropolis                 99
4                   Coco                 97
...                  ...                ...
1585              Priest                 15
1586    American Outlaws                 14
1587      September Dawn                 15
1588           Jonah Hex                 12
1589       Texas Rangers                  2

[1590 rows x 2 columns]

In [24]:
rt_df.columns =  map(str.lower, rt_df.columns)
rt_df.head()

                title  ratingtomatometer
0       Black Panther                 97
1  Mad Max: Fury Road                 97
2        Wonder Woman                 93
3          Metropolis                 99
4                Coco                 97

In [10]:
rt_df.dtypes

Title                object
RatingTomatometer     int64
dtype: object

## Create Database Connection

In [11]:
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect, func

In [18]:
engine = create_engine('postgresql://********:**********@localhost:5432/etl_project')
connection = engine.connect()

In [20]:
# Add dataframes to sql
imdb_df.to_sql(name='imdb', con=engine, if_exists='append', index=True)

In [25]:
# Add dataframes to sql
rt_df.to_sql(name='rt', con=engine, if_exists='append', index=True)

In [22]:
# Confirm tables
engine.table_names()

<ipython-input-22-2d97e9123e98>:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['imdb', 'rt']